Ran Plan for dir: `deployment/cloud` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/bin/terraform plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/greyhats13/fta_iac/15/default/deployment/cloud/default.tfplan\"" in "/home/atlantis/.atlantis/repos/greyhats13/fta_iac/15/default/deployment/cloud": exit status 1
random_password.atlantis_github_secret: Refreshing state... [id=none]
random_password.argocd_github_secret: Refreshing state... [id=none]
tls_private_key.atlantis_ssh: Refreshing state... [id=ba414c15ec6ee3751969af86b952181bd7a049de]
tls_private_key.argocd_ssh: Refreshing state... [id=baff63c4e0d4523254b3062c13ba69027edae3f1]
random_password.atlantis_password: Refreshing state... [id=none]
data.google_project.curent: Reading...
module.kms_main.google_service_account.service_account: Refreshing state... [id=projects/fta-platform/serviceAccounts/fta-mstr-kms-main-sa@fta-platform.iam.gserviceaccount.com]
module.kms_main.google_kms_key_ring.keyring: Refreshing state... [id=projects/fta-platform/locations/global/keyRings/fta-mstr-kms-main-keyring]
module.gsm_iac.google_secret_manager_secret.secret: Refreshing state... [id=projects/fta-platform/secrets/fta-mstr-gsm-iac]
module.gcs_tfstate.google_storage_bucket.bucket: Refreshing state... [id=fta-mstr-gcs-tfstate]
module.dns_main.google_dns_managed_zone.zone: Refreshing state... [id=projects/fta-platform/managedZones/fta-mstr-dns-main]
module.repo_iac.github_repository.repo[0]: Refreshing state... [id=fta_iac]
module.repo_gitops.github_repository.repo[0]: Refreshing state... [id=fta_gitops]
module.kms_main.google_kms_crypto_key.cryptokey: Refreshing state... [id=projects/fta-platform/locations/global/keyRings/fta-mstr-kms-main-keyring/cryptoKeys/fta-mstr-kms-main-cryptokey]
data.google_kms_secret.iac_secrets["github_oauth_client_secret"]: Reading...
data.google_kms_secret.iac_secrets["github_token_atlantis"]: Reading...
data.google_kms_secret.iac_secrets["github_token_iac"]: Reading...
data.google_kms_secret.iac_secrets["github_token_iac"]: Read complete after 0s [id=projects/fta-platform/locations/global/keyRings/fta-mstr-kms-main-keyring/cryptoKeys/fta-mstr-kms-main-cryptokey:CiQAVucnPlSoVrFW356BVXK9h9ZVPm4bPTVX9heDhVq759X3f4gSUQA4ny4NQIrKNdhCf1d1Dlh9lCIUxkNRl7HPfKAZ0UeLvb8cH19Ru0Zss/1ChBO0MTsBQAi8uQs+ORnGlYr2kK07ZjtJyP+pRE/e0fnCfRzWsw==]
module.repo_gitops.github_branch.dev[0]: Refreshing state... [id=fta_gitops:dev]
data.google_kms_secret.iac_secrets["github_oauth_client_secret"]: Read complete after 0s [id=projects/fta-platform/locations/global/keyRings/fta-mstr-kms-main-keyring/cryptoKeys/fta-mstr-kms-main-cryptokey:CiQAVucnPodamJwhIqvM+KAl7yioXUWrKm/epygLNDmKFMvOhhsSUQA4ny4Nj5+dS0DhAUkJRu4if7ICztZZreZ9rJ1IrWPbvIUXYcRFo1SlwdiZzN72B1N6ELSV9drAC9RC551Jzl0CCXl/7Ib50yNjzYLsdKtnpQ==]
data.google_kms_secret.iac_secrets["github_token_atlantis"]: Read complete after 0s [id=projects/fta-platform/locations/global/keyRings/fta-mstr-kms-main-keyring/cryptoKeys/fta-mstr-kms-main-cryptokey:CiQAVucnPr5qKyBOkvYYJ+uPfeQtWvUhnRbVYvMVTW5wH3FuIjYSUQA4ny4N9JrVLRwJS18xd0ZSXjy0iJ/pS6jUlnh4EE4fapDtM31ALvEkNEM/5iX2/U7bwaTpi9YuVT1Lxc955JSEhxZUn83fD0ByMtvv8FkB/A==]
module.gsm_iac.google_secret_manager_secret_version.secret_version: Refreshing state... [id=projects/781497044301/secrets/fta-mstr-gsm-iac/versions/1]
module.kms_main.google_kms_crypto_key_iam_binding.cryptokey_iam_binding: Refreshing state... [id=projects/fta-platform/locations/global/keyRings/fta-mstr-kms-main-keyring/cryptoKeys/fta-mstr-kms-main-cryptokey/roles/cloudkms.cryptoKeyEncrypterDecrypter]
module.repo_iac.github_branch.dev[0]: Refreshing state... [id=fta_iac:dev]
data.google_project.curent: Read complete after 2s [id=projects/fta-platform]
module.gcp_project.google_project_service.project["iam"]: Refreshing state... [id=fta-platform/iam.googleapis.com]
module.gcp_project.google_project_service.project["sql"]: Refreshing state... [id=fta-platform/sqladmin.googleapis.com]
module.gcp_project.google_project_service.project["service_networking"]: Refreshing state... [id=fta-platform/servicenetworking.googleapis.com]
module.gcp_project.google_project_service.project["gcs"]: Refreshing state... [id=fta-platform/storage.googleapis.com]
module.gcp_project.google_project_service.project["gke"]: Refreshing state... [id=fta-platform/container.googleapis.com]
module.gcp_project.google_project_service.project["firestore"]: Refreshing state... [id=fta-platform/firestore.googleapis.com]
module.gcp_project.google_project_service.project["cloud_dns"]: Refreshing state... [id=fta-platform/dns.googleapis.com]
module.gcp_project.google_project_service.project["secret_manager"]: Refreshing state... [id=fta-platform/secretmanager.googleapis.com]
module.gcp_project.google_project_service.project["gce"]: Refreshing state... [id=fta-platform/compute.googleapis.com]
module.gcp_project.google_project_service.project["kms"]: Refreshing state... [id=fta-platform/cloudkms.googleapis.com]
module.repo_gitops.github_repository_webhook.webhooks["argocd"]: Refreshing state... [id=502253815]
module.vpc_main.google_compute_network.vpc: Refreshing state... [id=projects/fta-platform/global/networks/fta-mstr-vpc-main]
module.repo_iac.github_repository_webhook.webhooks["atlantis"]: Refreshing state... [id=501983538]
module.firestore_main.google_firestore_database.database: Refreshing state... [id=projects/fta-platform/databases/(default)]
module.vpc_main.google_compute_firewall.firewall["icmp"]: Refreshing state... [id=projects/fta-platform/global/firewalls/fta-mstr-vpc-main-allow-icmp]
module.vpc_main.google_compute_subnetwork.subnet: Refreshing state... [id=projects/fta-platform/regions/asia-southeast2/subnetworks/fta-mstr-vpc-main-subnet]
module.vpc_main.google_compute_firewall.firewall["rdp"]: Refreshing state... [id=projects/fta-platform/global/firewalls/fta-mstr-vpc-main-allow-rdp]
module.vpc_main.google_compute_firewall.firewall["internal"]: Refreshing state... [id=projects/fta-platform/global/firewalls/fta-mstr-vpc-main-allow-internal]
module.vpc_main.google_compute_router.router: Refreshing state... [id=projects/fta-platform/regions/asia-southeast2/routers/fta-mstr-vpc-main-router]
module.vpc_main.google_compute_firewall.firewall["ssh"]: Refreshing state... [id=projects/fta-platform/global/firewalls/fta-mstr-vpc-main-allow-ssh]
module.gce_atlantis.google_compute_firewall.firewall["ssh"]: Refreshing state... [id=projects/fta-platform/global/firewalls/fta-mstr-gce-atlantis-allow-ssh]
module.gce_atlantis.google_compute_firewall.firewall["http"]: Refreshing state... [id=projects/fta-platform/global/firewalls/fta-mstr-gce-atlantis-allow-http]
module.gce_atlantis.google_service_account.sa: Refreshing state... [id=projects/fta-platform/serviceAccounts/fta-mstr-gce-atlantis-sa@fta-platform.iam.gserviceaccount.com]
module.gce_atlantis.google_compute_firewall.firewall["atlantis"]: Refreshing state... [id=projects/fta-platform/global/firewalls/fta-mstr-gce-atlantis-allow-atlantis]
module.gke_main.google_container_cluster.cluster: Refreshing state... [id=projects/fta-platform/locations/asia-southeast2-a/clusters/fta-mstr-gke-main]
module.gce_atlantis.google_compute_firewall.firewall["https"]: Refreshing state... [id=projects/fta-platform/global/firewalls/fta-mstr-gce-atlantis-allow-https]
module.vpc_main.google_compute_router_nat.nat: Refreshing state... [id=fta-platform/asia-southeast2/fta-mstr-vpc-main-router/fta-mstr-vpc-main-nat]
module.gce_atlantis.google_compute_instance.instance: Refreshing state... [id=projects/fta-platform/zones/asia-southeast2-a/instances/fta-mstr-gce-atlantis]
module.gce_atlantis.google_project_iam_member.sa_iam: Refreshing state... [id=fta-platform/roles/owner/serviceAccount:fta-mstr-gce-atlantis-sa@fta-platform.iam.gserviceaccount.com]
module.gke_main.google_container_node_pool.nodepool["spot"]: Refreshing state... [id=projects/fta-platform/locations/asia-southeast2-a/clusters/fta-mstr-gke-main/nodePools/spot]
module.cloudsql_instance_main.google_sql_database_instance.instance: Refreshing state... [id=fta-mstr-cloudsql-main]
module.gce_atlantis.google_dns_record_set.record[0]: Refreshing state... [id=projects/fta-platform/managedZones/fta-mstr-dns-main/rrsets/atlantis.fta.blast.co.id./A]
module.external_dns.google_service_account.gsa[0]: Refreshing state... [id=projects/fta-platform/serviceAccounts/fta-mstr-helm-external-dns@fta-platform.iam.gserviceaccount.com]
module.cert_manager.kubernetes_namespace.namespace[0]: Refreshing state... [id=cert-manager]
module.external_dns.kubernetes_namespace.namespace[0]: Refreshing state... [id=dns]
module.external_dns.google_project_iam_member.sa_iam[0]: Refreshing state... [id=fta-platform/roles/dns.admin/serviceAccount:fta-mstr-helm-external-dns@fta-platform.iam.gserviceaccount.com]
module.external_dns.helm_release.helm: Refreshing state... [id=fta-helm-external-dns]
module.external_dns.google_service_account_iam_binding.workload_identity_binding[0]: Refreshing state... [id=projects/fta-platform/serviceAccounts/fta-mstr-helm-external-dns@fta-platform.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
module.cert_manager.helm_release.helm: Refreshing state... [id=fta-helm-cert-manager]
module.external_dns.google_service_account_iam_binding.token_creator[0]: Refreshing state... [id=projects/fta-platform/serviceAccounts/fta-mstr-helm-external-dns@fta-platform.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator]
kubectl_manifest.cluster_issuer: Refreshing state... [id=/apis/cert-manager.io/v1/clusterissuers/letsencrypt-fta]
module.ingress_nginx.kubernetes_namespace.namespace[0]: Refreshing state... [id=ingress]
module.ingress_nginx.helm_release.helm: Refreshing state... [id=fta-helm-ingress-nginx]
module.argocd.kubernetes_namespace.namespace[0]: Refreshing state... [id=argocd]
module.repo_gitops.kubernetes_secret_v1.argocd[0]: Refreshing state... [id=argocd/fta-gitops]
module.argocd.google_service_account.gsa[0]: Refreshing state... [id=projects/fta-platform/serviceAccounts/fta-mstr-helm-argocd@fta-platform.iam.gserviceaccount.com]
module.argocd.google_project_iam_member.sa_iam[1]: Refreshing state... [id=fta-platform/roles/secretmanager.secretAccessor/serviceAccount:fta-mstr-helm-argocd@fta-platform.iam.gserviceaccount.com]
module.argocd.google_project_iam_member.sa_iam[0]: Refreshing state... [id=fta-platform/roles/container.admin/serviceAccount:fta-mstr-helm-argocd@fta-platform.iam.gserviceaccount.com]
module.argocd.helm_release.helm: Refreshing state... [id=fta-helm-argocd]
module.argocd.google_service_account_iam_binding.workload_identity_binding[0]: Refreshing state... [id=projects/fta-platform/serviceAccounts/fta-mstr-helm-argocd@fta-platform.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
module.argocd.google_service_account_iam_binding.token_creator[0]: Refreshing state... [id=projects/fta-platform/serviceAccounts/fta-mstr-helm-argocd@fta-platform.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.gke_main.google_container_cluster.cluster has changed
  ~ resource "google_container_cluster" "cluster" {
        id                                       = "projects/fta-platform/locations/asia-southeast2-a/clusters/fta-mstr-gke-main"
      ~ master_version                           = "1.30.3-gke.1639000" -> "1.30.3-gke.1969001"
        name                                     = "fta-mstr-gke-main"
        # (34 unchanged attributes hidden)

        # (22 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.tls_public_key.argocd_public_key will be read during apply
  # (config refers to values not yet known)
 <= data "tls_public_key" "argocd_public_key" {
      + algorithm                     = (known after apply)
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
    }

  # data.tls_public_key.atlantis_public_key will be read during apply
  # (config refers to values not yet known)
 <= data "tls_public_key" "atlantis_public_key" {
      + algorithm                     = (known after apply)
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
    }

  # kubectl_manifest.sonarqube_secret will be created
  + resource "kubectl_manifest" "sonarqube_secret" {
      + api_version             = (known after apply)
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = (known after apply)
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = (known after apply)
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = (known after apply)
      + yaml_incluster          = (sensitive value)
    }

  # random_password.sonarqube_admin_password will be created
  + resource "random_password" "sonarqube_admin_password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 12
      + lower            = true
      + min_lower        = 3
      + min_numeric      = 3
      + min_special      = 0
      + min_upper        = 3
      + number           = true
      + numeric          = true
      + override_special = "!#$%&*@"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # random_password.sonarqube_jdbc_password will be created
  + resource "random_password" "sonarqube_jdbc_password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 12
      + lower            = true
      + min_lower        = 3
      + min_numeric      = 3
      + min_special      = 0
      + min_upper        = 3
      + number           = true
      + numeric          = true
      + override_special = "!#$%&*@"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.argocd.helm_release.helm will be updated in-place
  ~ resource "helm_release" "helm" {
        id                         = "fta-helm-argocd"
      ~ metadata                   = [
          - {
              - app_version    = "v2.12.3"
              - chart          = "argo-cd"
              - first_deployed = 1726590129
              - last_deployed  = 1726590129
              - name           = "fta-helm-argocd"
              - namespace      = "argocd"
              - notes          = <<-EOT
                    In order to access the server UI you have the following options:
                    
                    1. kubectl port-forward service/fta-helm-argocd-server -n argocd 8080:443
                    
                        and then open the browser on http://localhost:8080 and accept the certificate
                    
                    2. enable ingress in the values file `server.ingress.enabled` and either
                          - Add the annotation for ssl passthrough: https://argo-cd.readthedocs.io/en/stable/operator-manual/ingress/#option-1-ssl-passthrough
                          - Set the `configs.params."server.insecure"` in the values file and terminate SSL at your ingress: https://argo-cd.readthedocs.io/en/stable/operator-manual/ingress/#option-2-multiple-ingress-objects-and-hosts
                    
                    
                    After reaching the UI the first time you can login with username: admin and the random password generated during the installation. You can find the password by running:
                    
                    kubectl -n argocd get secret argocd-initial-admin-secret -o jsonpath="{.data.password}" | base64 -d
                    
                    (You should delete the initial secret afterwards as suggested by the Getting Started Guide: https://argo-cd.readthedocs.io/en/stable/getting_started/#4-login-using-the-cli)
                EOT
              - revision       = 1
              - values         = jsonencode(
                    {
                      - configs    = {
                          - cm     = {
                              - "dex.config" = <<-EOT
                                    connectors:
                                      - type: github
                                        id: github
                                        name: GitHub
                                        config:
                                          clientID: 9781757e794562ceb7e1
                                          clientSecret: $argocd-secret:dex.github.clientSecret
                                          redirectURI: 'https://argocd.fta.blast.co.id/api/dex/callback'
                                          orgs:
                                            - name: blastcoid
                                EOT
                              - url          = "https://argocd.fta.blast.co.id"
                            }
                          - cmp    = {
                              - create  = true
                              - plugins = {
                                  - argocd-vault-plugin-helm = {
                                      - allowConcurrency = true
                                      - discover         = {
                                          - find = {
                                              - command = [
                                                  - "sh",
                                                  - "-c",
                                                  - "find . -name 'Chart.yaml' && find . -name 'values.yaml'",
                                                ]
                                            }
                                        }
                                      - generate         = {
                                          - command = [
                                              - "sh",
                                              - "-c",
                                              - <<-EOT
                                                    helm template $ARGOCD_APP_NAME -n $ARGOCD_APP_NAMESPACE . --include-crds |
                                                    argocd-vault-plugin generate -
                                                EOT,
                                            ]
                                        }
                                      - lockRepo         = false
                                    }
                                }
                            }
                          - params = {
                              - "server.insecure" = true
                            }
                          - rbac   = {
                              - "policy.csv"     = <<-EOT
                                    # default policy
                                    p, role:readonly, applications, get, */*, allow
                                    p, role:readonly, certificates, get, *, allow
                                    p, role:readonly, clusters, get, *, allow
                                    p, role:readonly, repositories, get, *, allow
                                    p, role:readonly, projects, get, *, allow
                                    p, role:readonly, accounts, get, *, allow
                                    p, role:readonly, gpgkeys, get, *, allow
                                    p, role:readonly, logs, get, */*, allow
                                    # admin policy
                                    p, role:devops-role, applications, create, */*, allow
                                    p, role:devops-role, applications, update, */*, allow
                                    p, role:devops-role, applications, delete, */*, allow
                                    p, role:devops-role, applications, sync, */*, allow
                                    p, role:devops-role, applications, override, */*, allow
                                    p, role:devops-role, applications, action/*, */*, allow
                                    p, role:devops-role, applicationsets, get, */*, allow
                                    p, role:devops-role, applicationsets, create, */*, allow
                                    p, role:devops-role, applicationsets, update, */*, allow
                                    p, role:devops-role, applicationsets, delete, */*, allow
                                    p, role:devops-role, certificates, create, *, allow
                                    p, role:devops-role, certificates, update, *, allow
                                    p, role:devops-role, certificates, delete, *, allow
                                    p, role:devops-role, clusters, create, *, allow
                                    p, role:devops-role, clusters, update, *, allow
                                    p, role:devops-role, clusters, delete, *, allow
                                    p, role:devops-role, repositories, create, *, allow
                                    p, role:devops-role, repositories, update, *, allow
                                    p, role:devops-role, repositories, delete, *, allow
                                    p, role:devops-role, projects, create, *, allow
                                    p, role:devops-role, projects, update, *, allow
                                    p, role:devops-role, projects, delete, *, allow
                                    p, role:devops-role, accounts, update, *, allow
                                    p, role:devops-role, gpgkeys, create, *, allow
                                    p, role:devops-role, gpgkeys, delete, *, allow
                                    p, role:devops-role, exec, create, */*, allow
                                    # set admin policy for devops team in github orgs
                                    g, blastcoid:devops, role:devops-role
                                    g, devops, role:devops-role
                                EOT
                              - "policy.default" = "role:readonly"
                            }
                          - secret = {
                              - extra        = {
                                  - "dex.github.clientSecret" = "8a4ebc74ad2a3ea44a63f0cbb5bd6896fe0e59e1"
                                }
                              - githubSecret = "(sensitive value)"
                            }
                        }
                      - controller = {
                          - serviceAccount = {
                              - annotations = {
                                  - "iam.gke.io/gcp-service-account" = "fta-mstr-helm-argocd@fta-platform.iam.gserviceaccount.com"
                                }
                            }
                        }
                      - global     = {
                          - domain       = "argocd.fta.blast.co.id"
                          - nodeSelector = {
                              - "iam.gke.io/gke-metadata-server-enabled" = "true"
                            }
                        }
                      - repoServer = {
                          - extraContainers = [
                              - {
                                  - command         = [
                                      - "/var/run/argocd/argocd-cmp-server",
                                    ]
                                  - image           = "quay.io/argoproj/argocd:v2.12.3"
                                  - name            = "avp-helm"
                                  - securityContext = {
                                      - runAsNonRoot = true
                                      - runAsUser    = 999
                                    }
                                  - volumeMounts    = [
                                      - {
                                          - mountPath = "/var/run/argocd"
                                          - name      = "var-files"
                                        },
                                      - {
                                          - mountPath = "/home/argocd/cmp-server/plugins"
                                          - name      = "plugins"
                                        },
                                      - {
                                          - mountPath = "/tmp"
                                          - name      = "cmp-tmp"
                                        },
                                      - {
                                          - mountPath = "/home/argocd/cmp-server/config/plugin.yaml"
                                          - name      = "argocd-cmp-cm"
                                          - subPath   = "argocd-vault-plugin-helm.yaml"
                                        },
                                      - {
                                          - mountPath = "/usr/local/bin/argocd-vault-plugin"
                                          - name      = "custom-tools"
                                          - subPath   = "argocd-vault-plugin"
                                        },
                                    ]
                                },
                            ]
                          - initContainers  = [
                              - {
                                  - args         = [
                                      - "curl -L https://github.com/argoproj-labs/argocd-vault-plugin/releases/download/v1.18.1/argocd-vault-plugin_1.18.1_linux_amd64 -o argocd-vault-plugin && chmod +x argocd-vault-plugin && mv argocd-vault-plugin /custom-tools/",
                                    ]
                                  - command      = [
                                      - "sh",
                                      - "-c",
                                    ]
                                  - env          = [
                                      - {
                                          - name  = "AVP_VERSION"
                                          - value = "1.18.1"
                                        },
                                    ]
                                  - image        = "registry.access.redhat.com/ubi8"
                                  - name         = "download-tools"
                                  - volumeMounts = [
                                      - {
                                          - mountPath = "/custom-tools"
                                          - name      = "custom-tools"
                                        },
                                    ]
                                },
                            ]
                          - serviceAccount  = {
                              - annotations                  = {
                                  - "iam.gke.io/gcp-service-account" = "fta-mstr-helm-argocd@fta-platform.iam.gserviceaccount.com"
                                }
                              - automountServiceAccountToken = true
                              - name                         = "argocd-repo-server"
                            }
                          - volumes         = [
                              - {
                                  - configMap = {
                                      - name = "argocd-cmp-cm"
                                    }
                                  - name      = "argocd-cmp-cm"
                                },
                              - {
                                  - emptyDir = {}
                                  - name     = "cmp-tmp"
                                },
                              - {
                                  - emptyDir = {}
                                  - name     = "custom-tools"
                                },
                            ]
                        }
                      - server     = {
                          - ingress        = {
                              - annotations      = {
                                  - "cert-manager.io/cluster-issuer"                 = "letsencrypt-fta"
                                  - "external-dns.alpha.kubernetes.io/hostname"      = "argocd.fta.blast.co.id"
                                  - "external-dns.alpha.kubernetes.io/ttl"           = "300"
                                  - "kubernetes.io/tls-acme"                         = "true"
                                  - "nginx.ingress.kubernetes.io/force-ssl-redirect" = "true"
                                  - "nginx.ingress.kubernetes.io/ssl-passthrough"    = "true"
                                }
                              - enabled          = true
                              - ingressClassName = "nginx"
                              - tls              = true
                            }
                          - service        = {
                              - servicePortHttp     = 80
                              - servicePortHttpName = "http"
                              - type                = "ClusterIP"
                            }
                          - serviceAccount = {
                              - annotations = {
                                  - "iam.gke.io/gcp-service-account" = "fta-mstr-helm-argocd@fta-platform.iam.gserviceaccount.com"
                                }
                            }
                        }
                    }
                )
              - version        = "7.5.2"
            },
        ] -> (known after apply)
        name                       = "fta-helm-argocd"
        # (27 unchanged attributes hidden)

      - set_sensitive {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - set_sensitive {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + set_sensitive {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + set_sensitive {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.gce_atlantis.google_compute_instance.instance will be updated in-place
  ~ resource "google_compute_instance" "instance" {
        id                   = "projects/fta-platform/zones/asia-southeast2-a/instances/fta-mstr-gce-atlantis"
      ~ metadata             = {
          - "ssh-keys" = <<-EOT
                atlantis:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCppPJxXdhuCczb0vJOXWb5ER6UBM0cNqB1ca51WPYUS8dc96Bv3FakPQ+CIusvH0GtaqfKau3IvGwAEnUGOkIuSYdtB8wf+V4YMt1mM8/CcsOQxGTuh73QpeeLkAlMDJ6JHXr0x9++NTiLCwaTuEZ1pcp1cr9jXK4tUvD/lLvpr34XAPsbWY9dDA9s2LbSl9XwKIAGB2AsKRkHqgXtiKAsiW4gHlcOPxxb5uLfZDRM0eK0cp9+RY3kHQZ7WTXSHl4mbg9EwUn2zmbmdiPiPpMVZsOFnHy9POwZXcMqoeCzqmvgDpJk75gtZEX0Gh20LIu5CPVK1trZKBDMYSdbJtCN
            EOT
        } -> (known after apply)
        name                 = "fta-mstr-gce-atlantis"
        tags                 = [
            "atlantis",
        ]
        # (20 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.gke_main.google_container_cluster.cluster will be updated in-place
  ~ resource "google_container_cluster" "cluster" {
        id                                       = "projects/fta-platform/locations/asia-southeast2-a/clusters/fta-mstr-gke-main"
        name                                     = "fta-mstr-gke-main"
        # (35 unchanged attributes hidden)

      ~ master_authorized_networks_config {
            # (1 unchanged attribute hidden)

          - cidr_blocks {
              - cidr_block   = "103.104.13.0/24" -> null
              - display_name = "my-home-public-ip" -> null
            }
          + cidr_blocks {
              + cidr_block   = "103.104.0.0/16"
              + display_name = "my-home-public-ip"
            }
        }

        # (21 unchanged blocks hidden)
    }

  # module.gsm_iac.google_secret_manager_secret_version.secret_version must be replaced
-/+ resource "google_secret_manager_secret_version" "secret_version" {
      ~ create_time           = "2024-09-18T23:18:55.783077Z" -> (known after apply)
      + destroy_time          = (known after apply)
      ~ id                    = "projects/781497044301/secrets/fta-mstr-gsm-iac/versions/1" -> (known after apply)
      ~ name                  = "projects/781497044301/secrets/fta-mstr-gsm-iac/versions/1" -> (known after apply)
      ~ secret_data           = (sensitive value) # forces replacement
      ~ version               = "1" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.repo_gitops.github_repository_webhook.webhooks["argocd"] will be updated in-place
  ~ resource "github_repository_webhook" "webhooks" {
        id         = "502253815"
        # (4 unchanged attributes hidden)

      ~ configuration {
          ~ secret       = (sensitive value)
            # (3 unchanged attributes hidden)
        }
    }

  # module.repo_gitops.kubernetes_secret_v1.argocd[0] will be updated in-place
  ~ resource "kubernetes_secret_v1" "argocd" {
      ~ data                           = (sensitive value)
        id                             = "argocd/fta-gitops"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repo_iac.github_repository_webhook.webhooks["atlantis"] will be updated in-place
  ~ resource "github_repository_webhook" "webhooks" {
        id         = "501983538"
        # (4 unchanged attributes hidden)

      ~ configuration {
          ~ secret       = (sensitive value)
            # (3 unchanged attributes hidden)
        }
    }

  # module.sonarqube.google_project_iam_member.sa_iam[0] will be created
  + resource "google_project_iam_member" "sa_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "fta-platform"
      + role    = "roles/cloudsql.client"
    }

  # module.sonarqube.google_service_account.gsa[0] will be created
  + resource "google_service_account" "gsa" {
      + account_id   = "fta-mstr-helm-sonarqube"
      + disabled     = false
      + display_name = "Service Account for helm fta-mstr-helm-sonarqube"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "fta-platform"
      + unique_id    = (known after apply)
    }

  # module.sonarqube.google_service_account_iam_binding.token_creator[0] will be created
  + resource "google_service_account_iam_binding" "token_creator" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "serviceAccount:fta-platform.svc.id.goog[sonarqube/fta-mstr-helm-sonarqube]",
        ]
      + role               = "roles/iam.serviceAccountTokenCreator"
      + service_account_id = (known after apply)
    }

  # module.sonarqube.google_service_account_iam_binding.workload_identity_binding[0] will be created
  + resource "google_service_account_iam_binding" "workload_identity_binding" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "serviceAccount:fta-platform.svc.id.goog[sonarqube/fta-mstr-helm-sonarqube]",
        ]
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # module.sonarqube.helm_release.helm will be created
  + resource "helm_release" "helm" {
      + atomic                     = false
      + chart                      = "sonarqube"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = true
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "fta-helm-sonarqube"
      + namespace                  = "sonarqube"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://SonarSource.github.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = (sensitive value)
      + verify                     = false
      + version                    = (known after apply)
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.sonarqube.kubernetes_namespace.namespace[0] will be created
  + resource "kubernetes_namespace" "namespace" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "sonarqube"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.sql_sonar_jdbc.google_sql_database.database will be created
  + resource "google_sql_database" "database" {
      + charset         = "UTF8"
      + collation       = "en_US.UTF8"
      + deletion_policy = "DELETE"
      + id              = (known after apply)
      + instance        = "fta-mstr-cloudsql-main"
      + name            = "sonar_db"
      + project         = "fta-platform"
      + self_link       = (known after apply)
    }

  # module.sql_sonar_jdbc.google_sql_user.user will be created
  + resource "google_sql_user" "user" {
      + host                    = (known after apply)
      + id                      = (known after apply)
      + instance                = "fta-mstr-cloudsql-main"
      + name                    = (sensitive value)
      + password                = (sensitive value)
      + project                 = "fta-platform"
      + sql_server_user_details = (known after apply)
    }

Plan: 12 to add, 6 to change, 1 to destroy.
╷
│ Error: Invalid count argument
│ 
│   on ../../modules/cicd/github_repo/repo.tf line 172, in resource "github_repository_deploy_key" "repository_deploy_key":
│  172:   count      = var.public_key != null ? 1 : 0
│ 
│ The "count" value depends on resource attributes that cannot be determined
│ until apply, so Terraform cannot predict how many instances will be
│ created. To work around this, use the -target argument to first apply only
│ the resources that the count depends on.
╵


```
</details>